const SCH_COLLEGE_STATE = {
  id: 'sch',
  name: '순천향대학교',
  logo: '/assets/univ-logo/SCH.svg',
  webMail: 'https://mail.sch.ac.kr/account/login.do',
  state: [
    { college: '의과대학', department: ['의예과', '의학과', '간호학과'] },
    {
      college: '자연과학대학',
      department: [
        '수학과',
        '전자물리학과',
        '화학과',
        '식품영양학과',
        '환경보건학과',
        '생명과학과',
        '스포츠과학과',
        '사회체육학과',
        '스포츠의학과',
      ],
    },
    {
      college: '인문사회과학대학',
      department: [
        '국어국문학과',
        '영어영문학과',
        '중어중문학과',
        '국제문화학과',
        '유아교육과',
        '특수교육과',
        '청소년교육상담학과',
        '연극무용학과',
        '영화애니메이션학과',
        '미디어콘텐츠학과',
        '법학과',
        '행정학과',
        '경찰행정학과',
        '신문방송학과',
        '사회복지학과',
      ],
    },
    {
      college: '글로벌경영대학',
      department: [
        'GBS',
        '경영학과',
        '국제통상학과',
        '관광경영학과',
        '경제금융학과',
        'IT금융경영학과',
        '글로벌문화산업학과',
        '회계학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '컴퓨터공학과',
        '정보통신공학과',
        '전자공학과',
        '전기공학과',
        '전자정보공학과',
        '나노화학공학과',
        '에너지환경공학과',
        '디스플레이신소재공학과',
        '기계공학과',
      ],
    },
    {
      college: 'SW융합대학',
      department: [
        '컴퓨터소프트웨어공학과',
        '정보보호학과',
        '의료IT공학과',
        'AI빅데이터학과',
        '사물인터넷학과',
        '메타버스&게임학과',
      ],
    },
    {
      college: '의료과학대학',
      department: [
        '보건행정경영학과',
        '의료생명공학과',
        '임상병리학과',
        '작업치료학과',
        '의약공학과',
        '의공학과',
      ],
    },
    {
      college: 'SCH미디어랩스',
      department: [
        '한국문화콘텐츠학과',
        '영미학과',
        '중국학과',
        '미디어커뮤니케이션학과',
        '건축학과',
        '디지털애니메이션학과',
        '스마트자동차학과',
        '에너지공학과',
        '공연영상학과',
        'SCH미디어랩스',
      ],
    },
    {
      college: '창의라이프대학',
      department: [
        '스마트팩토리공학과',
        '스마트모빌리티공학과',
        '융합바이오화학공학과',
        '산업경영공학과',
        '세무회계학과',
        '자동차산업공학과',
        '융합기계학과',
        '신뢰성품질공학과',
        '화학공학과',
        '메카트로닉스공학과',
        '창의라이프대학',
      ],
    },
    {
      college: '엔터프라이즈스쿨',
      department: [
        '융합창업학부',
        '학생기업학부',
        '컨버전스디자인학과',
        'DSC모빌리티학부',
      ],
    },
  ],
};

const KHU_COLLEGE_STATE = {
  id: 'khu',
  name: '경희대학교',
  logo: '/assets/univ-logo/KHU.svg',
  webMail: 'https://mail.khu.ac.kr/',
  state: [
    {
      college: '후마니타스컬리지',
      department: ['후마니타스컬리지'],
    },
    {
      college: '문과대학',
      department: [
        '국어국문학과',
        '영어영문학과',
        '응용영어통번역학과',
        '사학과',
        '철학과',
      ],
    },
    {
      college: '법과대학',
      department: ['법학부'],
    },
    {
      college: '정경대학',
      department: [
        '정치외교학과',
        '행정학과',
        '사회학과',
        '미디어학과',
        '경제학과',
        '무역학과',
        '국제통상학전공',
        '국제금융투자학전공',
      ],
    },
    {
      college: '경영대학',
      department: ['경영학과', '회계세무학과', '빅데이터응용학과'],
    },
    {
      college: '호텔관광대학',
      department: [
        'Hospitality경영학과',
        '조리&푸드디자인학과',
        '관광학과',
        '문화엔터테인먼트학과',
        '글로벌Hospitality관광학과',
        '문화관광산업학과',
        '조리산업학과',
      ],
    },
    {
      college: '이과대학',
      department: [
        '수학과',
        '물리학과',
        '화학과',
        '생물학과',
        '지리학과',
        '미래정보디스플레이학부',
      ],
    },
    {
      college: '생활과학대학',
      department: ['아동가족학과', '주거환경학과', '의상학과', '식품영양학과'],
    },
    {
      college: '의과대학',
      department: ['의예과', '의학과'],
    },
    {
      college: '한의과대학',
      department: ['한의예과', '한의학과'],
    },
    {
      college: '치과대학',
      department: ['치의예과', '치의학과'],
    },
    {
      college: '약학대학',
      department: ['약학과', '한약학과', '약과학과'],
    },
    {
      college: '간호과학대학',
      department: ['간호학과'],
    },
    {
      college: '음악대학',
      department: ['작곡과', '성악과', '기악과'],
    },
    {
      college: '미술대학',
      department: ['한국화전공', '회화전공', '조소전공'],
    },
    {
      college: '무용학부',
      department: ['한국무용전공', '현대무용전공', '발레전공'],
    },
    {
      college: '자율전공학부',
      department: ['글로벌리더전공', '글로벌비지니스전공'],
    },
    {
      college: '공과대학',
      department: [
        '기계공학과',
        '산업경영공학과',
        '원자력공학과',
        '화학공학과',
        '정보전자신소재공학과',
        '사회기반시스템공학과',
        '건축공학과',
        '환경학및환경공학과',
        '건축학과',
      ],
    },
    {
      college: '전자정보대학',
      department: ['전자공학과', '반도체공학과', '생체의공학과'],
    },
    {
      college: '소프트웨어융합대학',
      department: ['컴퓨터공학과', '인공지능학과', '소프트웨어융합학과'],
    },
    {
      college: '응용과학대학',
      department: ['응용수학과', '응용물리학과', '응용화학과', '우주과학과'],
    },
    {
      college: '생명과학대학',
      department: [
        '유전생명공학과',
        '식품생명공학과',
        '한방생명공학과',
        '식물환경신소재공학과',
        '스마트팜과학과',
      ],
    },
    {
      college: '국제대학',
      department: ['국제학과', '글로벌한국학과'],
    },
    {
      college: '외국어대학',
      department: [
        '프랑스어학과',
        '스페인어학과',
        '러시아어학과',
        '중국어학과',
        '일본어학과',
        '한국어학과',
        '영미어문전공',
        '영미문화전공',
      ],
    },
    {
      college: '예술디자인대학',
      department: [
        '산업디자인학과',
        '시각디자인학과',
        '환경조경디자인학과',
        '의류디자인학과',
        '디지털콘텐츠학과',
        'PostModern음악학과',
        '연극영화학과',
        '도예학과',
      ],
    },
    {
      college: '체육대학',
      department: [
        '체육학과',
        '스포츠지도학과',
        '스포츠의학과',
        '골프산업학과',
        '태권도학과',
      ],
    },
    {
      college: '동서의과학과',
      department: ['동서의과학과'],
    },
  ],
};

const SWU_COLLEGE_STATE = {
  id: 'swu',
  name: '서울여자대학교',
  logo: '/assets/univ-logo/SWU.svg',
  webMail: 'https://mc183.mailplug.com/member/login?host_domain=swu.ac.kr',
  state: [
    {
      college: '인문대학',
      department: [
        '메타버스융합콘텐츠전공',
        '프랑스문화콘텐츠전공',
        '독일문화콘텐츠전공',
        '국어국문학과',
        '영어영문학과',
        '중어중문학과',
        '일어일문학과',
        '사학과',
        '기독교학과',
        '불어불문학과',
        '독어독문학과',
      ],
    },
    {
      college: '사회과학대학',
      department: [
        '경제학과',
        '문헌정보학과',
        '사회복지학과',
        '아동학과',
        '행정학과',
        '언론영상학부',
        '교육심리학과',
        '스포츠운동과학과',
      ],
    },
    {
      college: '과학기술융합대학',
      department: [
        '수학과',
        '화학과',
        '생명환경공학과',
        '바이오헬스융합학과',
        '원예생명조경학과',
        '식품공학과',
        '식품영양학과',
        '화학생명환경과학부',
        '식품응용시스템학부',
      ],
    },
    {
      college: '미래산업융합대학',
      department: [
        '경영학과',
        '패션산업학과',
        '디지털미디어학과',
        '정보보호학부',
        '소프트웨어융합학과',
        '데이터사이언스학과',
        '산업디자인학과',
      ],
    },
    {
      college: '아트앤디자인스쿨',
      department: [
        '현대미술전공',
        '공예전공',
        '시각디자인전공',
        '첨단미디어디자인전공',
      ],
    },
    {
      college: '자율전공학부',
      department: ['자율전공'],
    },
  ],
};

const DGU_COLLEGE_STATE = {
  id: 'dgu',
  name: '동국대학교',
  logo: '/assets/univ-logo/DGU.svg',
  webMail: 'https://mail.dongguk.edu/',
  state: [
    {
      college: '불교대학',
      department: ['불교학부', '문화재학과'],
    },
    {
      college: '문과대학',
      department: [
        '국어국문학전공',
        '문예창작학전공',
        '영어문학전공',
        '영어통번역학전공',
        '일본학과',
        '중어중문학과',
        '철학과',
        '사학과',
      ],
    },
    {
      college: '이과대학',
      department: [
        '수학과',
        '화학과',
        '통계학과',
        '물리학전공',
        '반도체과학전공',
      ],
    },
    {
      college: '법과대학',
      department: ['법학과'],
    },
    {
      college: '사회과학대학',
      department: [
        '정치외교학전공',
        '행정학전공',
        '북한학전공',
        '경제학과',
        '국제통상학과',
        '사회학전공',
        '미디어커뮤니케이션학전공',
        '식품산업관리학과',
        '광고홍보학과',
        '사회복지학과',
      ],
    },
    {
      college: '경찰사법대학',
      department: ['경찰학전공', '범죄과학전공', '산업보안전공', '교정학전공'],
    },
    {
      college: '경영대학',
      department: ['경영학과', '회계학과', '경영정보학과'],
    },
    {
      college: '바이오시스템대학',
      department: [
        '바이오환경과학과',
        '생명과학과',
        '식품생명공학과',
        '의생명공학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '전자전기공학전공',
        '정보통신공학과',
        '건설환경공학과',
        '화공생물공학과',
        '기계로봇에너지공학과',
        '건축공학전공',
        '건축학전공',
        '산업시스템공학과',
        '에너지신소재공학과',
      ],
    },
    {
      college: 'AI융합대학',
      department: [
        '컴퓨터공학전공',
        '멀티미디어소프트웨어공학전공',
        '인공지능전공',
        '데이터사이언스전공',
        '엔터테인먼트테크놀로지전공',
        '시스템반도체학부',
      ],
    },
    {
      college: '사범대학',
      department: [
        '교육학과',
        '국어교육과',
        '역사교육과',
        '지리교육과',
        '수학교육과',
        '가정교육과',
        '체육교육과',
      ],
    },
    {
      college: '예술대학',
      department: [
        '불교미술전공',
        '한국화전공',
        '서양화전공',
        '조소전공',
        '연극전공',
        '뮤지컬전공',
        '영화영상학과',
        '스포츠문화학과',
        '한국음악과',
      ],
    },
    {
      college: '약학대학',
      department: ['약학대학'],
    },
    {
      college: '미래융합대학',
      department: ['융합보안학과', '사회복지상담학과', '글로벌무역학과'],
    },
  ],
};

const JNU_COLLEGE_STATE = {
  id: 'jnu',
  name: '전남대학교',
  logo: '/assets/univ-logo/JNU.svg',
  webMail: 'https://portal.jnu.ac.kr/',
  state: [
    {
      college: '간호대학',
      department: ['간호학과'],
    },
    {
      college: '경영대학',
      department: ['경영학부', '경제학부'],
    },
    {
      college: '공과대학',
      department: [
        '건축학부',
        '고분자융합소재공학부',
        '기계공학부',
        '산업공학과',
        '생물공학과',
        '신소재공학부',
        '에너지자원공학과',
        '전기공학과',
        '전자컴퓨터공학부',
        '전자공학과',
        '컴퓨터정보통신공학과',
        '소프트웨어공학과',
        '토목공학과',
        '화학공학부',
        '환경에너지공학과',
      ],
    },
    {
      college: '농업생명과학대학',
      department: [
        '응용식물학과',
        '원예생명공학과',
        '응용생물학과',
        '산림자원학과',
        '임산공학과',
        '농생명화학과',
        '식품공학과',
        '분자생명공학과',
        '동물자원학부',
        '지역바이오시스템공학과',
        '농업경제학과',
        '조경학과',
        '바이오에너지공학과',
        '융합바이오시스템기계공학과',
      ],
    },
    {
      college: '사범대학',
      department: [
        '가정교육과',
        '교육학과',
        '국어교육과',
        '물리교육과',
        '생물교육과',
        '수학교육과',
        '역사교육과',
        '영어교육과',
        '유아교육과',
        '윤리교육과',
        '음악교육과',
        '지구과학교육과',
        '지리교육과',
        '체육교육과',
        '특수교육학부',
        '화학교육과',
      ],
    },
    {
      college: '사회과학대학',
      department: [
        '문헌정보학과',
        '문화인류고고학과',
        '사회학과',
        '미디어커뮤니케이션학과',
        '심리학과',
        '정치외교학과',
        '지리학과',
        '행정학과',
      ],
    },
    {
      college: '생활과학대학',
      department: ['생활복지학과', '식품영양과학부', '의류학과'],
    },
    {
      college: '수의과대학',
      department: ['수의예과', '수의학과'],
    },
    {
      college: '약학대학',
      department: ['약학부'],
    },
    {
      college: '예술대학',
      department: ['국악학과', '디자인학과', '미술학과', '음악학과'],
    },
    {
      college: '의과대학',
      department: ['의학과', '의예과'],
    },
    {
      college: '인문대학',
      department: [
        '국어국문학과',
        '독일언어문학과',
        '불어불문학과',
        '사학과',
        '영어영문학과',
        '일어일문학과',
        '중어중문학과',
        '철학과',
      ],
    },
    {
      college: '자연과학대학',
      department: [
        '물리학과',
        '생명과학기술학부',
        '생물학과',
        '수학과',
        '지구환경과학부',
        '통계학과',
        '화학과',
      ],
    },
    {
      college: 'AI융합대학',
      department: [
        '융합전공',
        '인공지능학부',
        '빅데이터융합학과',
        '지능형모빌리티융합학과',
        '지능실감미디어융합전공',
        '지식재산융합전공',
      ],
    },
    {
      college: '자율전공학부',
      department: ['자율전공학부'],
    },
  ],
};

const KAYA_COLLEGE_STATE = {
  id: 'kaya',
  name: '가야대학교',
  webMail: 'https://mail.kaya.ac.kr/',
  state: [
    {
      college: '가야대학교',
      department: [
        '경찰소방학과',
        '귀금속주얼리학과',
        '사회복지상담학과',
        '언어치료청각학과',
        '경영물류학과',
        '외식조리영양학부',
        '간호학과',
        '안경광학과',
        '방사선학과',
        '작업치료학과',
        '물리치료학과',
        '유아교육과',
        '특수교육과',
        '스포츠재활복지학과',
        '부동산금융재테크학과',
      ],
    },
  ],
};

const GACHON_COLLEGE_STATE = {
  id: 'gachon',
  name: '가천대학교',
  webMail: 'https://gmail.com/',
  state: [
    {
      college: '가천리버럴아츠칼리지',
      department: ['가천리버럴아츠칼리지(M)', '자유전공', '한국학전공'],
    },
    {
      college: '경영대학',
      department: ['경영학부', '금융수학과'],
    },
    {
      college: '사회과학대학',
      department: [
        '미디어커뮤니케이션학과',
        '관광경영학과',
        '경제학과',
        '의료산업경영학과',
        '응용통계학과',
        '사회복지학과',
        '유아교육학과',
        '심리학과',
      ],
    },
    {
      college: 'AI인문대학',
      department: [
        '한국어문학과',
        '영미어문학과',
        '동양어문학과',
        '유럽어문학과',
      ],
    },
    {
      college: '법과대학',
      department: ['법학과', '경찰행정학과', '행정학과', '경찰학연계전공'],
    },
    {
      college: '공과대학',
      department: [
        '도시계획학전공',
        '조경학전공',
        '실내건축학전공',
        '건축학전공',
        '건축공학전공',
        '설비소방공학과',
        '화공생명공학과',
        '기계공학과',
        '토목환경공학과',
        '산업경영공학과',
        '신소재공학과',
        '스마트팩토리전공',
        '미래자동차학과',
      ],
    },
    {
      college: '바이오나노대학',
      department: [
        '바이오나노학과',
        '화학과',
        '물리학과',
        '생명과학과',
        '식품생물공학과',
        '식품영양학과',
      ],
    },
    {
      college: 'IT융합대학',
      department: [
        'AI소프트웨어학부',
        '컴퓨터공학전공',
        '전기공학과',
        '에너지IT학과',
        '의공학과',
        '스마트시티학과',
        '스마트보안전공',
        '클라우드공학과',
        '게임·영상학과',
        '바이오의료기기학과',
      ],
    },
    {
      college: '한의과대학',
      department: ['한의예과', '한의학과'],
    },
    {
      college: '예술대학',
      department: [
        '회화조소전공',
        '시각디자인전공',
        '산업디자인전공',
        '패션디자인전공',
        '기악전공',
        '성악전공',
        '작곡전공',
        '체육전공',
        '태권도전공',
        '연기예술학과',
      ],
    },
    {
      college: '반도체대학',
      department: [
        '전자공학전공',
        '반도체공학전공',
        '차세대반도체설계전공',
        '반도체디스플레이학과',
        '반도체설계학과',
      ],
    },
    {
      college: '의과대학',
      department: ['의과대학'],
    },
    {
      college: '약학대학',
      department: ['약학과', '바이오로직스학과'],
    },
    {
      college: '간호대학',
      department: ['간호학과'],
    },
    {
      college: '의과학대학',
      department: [
        '치위생학과',
        '응급구조학과',
        '방사선학과',
        '물리치료학과',
        '의용생체공학과',
        '운동재활학과',
      ],
    },
  ],
};

const CKU_COLLEGE_STATE = {
  id: 'cku',
  name: '가톨릭관동대학교',
  webMail: 'https://gmail.com/',
  state: [
    {
      college: '트리니티융합대학',
      department: [
        '자율전공학부',
        '경영학전공',
        '행정학전공',
        '경찰행정학전공',
        '해양경찰학전공',
        '사회복지학전공',
        '광고홍보학전공',
        '호텔관광경영학전공',
        '조리외식경영학전공',
        '의료경영학전공',
        '항공교통물류전공',
        '콘텐츠제작전공',
        '의생명과학전공',
        '건축공학전공',
        '건축학전공',
        '디지털헬스케어전공',
        '항공운항전공',
        '항공정비학전공',
        '스마트항만공학전공',
        '스포츠레저학전공',
        '스포츠재활의학전공',
        '스포츠지도학전공',
        '실용음악전공',
        'CG디자인전공',
      ],
    },
    {
      college: '사범대학',
      department: [
        '국어교육과',
        '지리교육과',
        '영어교육과',
        '역사교육과',
        '수학교육과',
        '컴퓨터교육과',
        '체육교육과',
        '교직과',
      ],
    },
    {
      college: '의과대학',
      department: ['의학과', '간호학과'],
    },
    {
      college: '헬스케어융합대학',
      department: ['임상병리학과', '치위생학과'],
    },
    {
      college: '휴먼서비스대학',
      department: [
        '언어재활학과',
        '치매전문재활학과',
        '산림치유학과',
        '복지상담학과',
        '스마트통합치유학과',
        '해양치유레저학과',
      ],
    },
    {
      college: '공과대학',
      department: ['토목공학과', '전자공학과', '소프트웨어학과'],
    },
    {
      college: '항공대학',
      department: ['항공운항서비스학과', '무인항공학과'],
    },
    {
      college: '미디어예술대학',
      department: ['공연예술학부', '뷰티디자인학과'],
    },
    {
      college: '관광스포츠대학',
      department: ['관광경영학과'],
    },
    {
      college: '의료융합대학',
      department: ['의료IT학과', '안경광학과', '바이오융합공학과'],
    },
  ],
};

const CATHOLIC_COLLEGE_STATE = {
  id: 'catholic',
  name: '가톨릭대학교',
  webMail: 'https://mail.catholic.ac.kr',
  state: [
    {
      college: '인문대학',
      department: [
        '국어국문학과',
        '철학과',
        '국사학과',
        '영어영문학부',
        '중국언어문화학과',
        '일어일본문화학과',
        '프랑스어문화학과',
        '음악과',
        '신학대학',
        '성악과',
        '한국어문화학과',
      ],
    },
    {
      college: '사회대학',
      department: [
        '사회복지학과',
        '심리학과',
        '사회학과',
        '특수교육과',
        '경영학과',
        '회계학과',
        '국제학부',
        '법학과',
        '경제학과',
        '행정학과',
        '글로벌미래경영학과',
        '세무회계금융학과',
        'IT파이낸스학과',
        '글로벌경영학과',
      ],
    },
    {
      college: '자연대학',
      department: [
        '화학과',
        '수학과',
        '물리학과',
        '공간디자인소비자학과',
        '의류학과',
        '아동학과',
        '식품영양학과',
        '의생명과학과',
        '약학대학',
        '간호대학',
        '의과대학',
      ],
    },
    {
      college: '공학대학',
      department: [
        '컴퓨터정보공학부',
        '미디어기술콘텐츠학과',
        '정보통신전자공학부',
        '생명공학과',
        '에너지환경공학과',
        '바이오메디컬화학공학과',
        '인공지능학과',
        '데이터사이언스학과',
        '바이오메디컬소프트웨어학과',
      ],
    },
    {
      college: '자유전공',
      department: ['자유전공학과'],
    },
    {
      college: 'CUK특화대학',
      department: ['학부대학', '융합전공학부'],
    },
    {
      college: '교직과정',
      department: ['교직과'],
    },
  ],
};

const KANGNAM_COLLEGE_STATE = {
  id: 'kangnam',
  name: '강남대학교',
  webMail: 'https://mail.kangnam.ac.kr',
  state: [
    {
      college: '복지융합대학',
      department: [
        '사회복지학부',
        '실버산업학과',
        '유니버설아트디자인학과',
        '스포츠복지학과',
        '음악학과',
      ],
    },
    {
      college: '경영관리대학',
      department: ['글로벌경영학부', '정경학부'],
    },
    {
      college: '글로벌인재대학',
      department: ['글로벌문화학부'],
    },
    {
      college: '공과대학',
      department: ['ICT융합공학부', '인공지능융합공학부', '부동산건설학부'],
    },
    {
      college: '사범대학',
      department: [
        '교육학과',
        '유아교육과',
        '초등특수교육과',
        '중등특수교육과',
      ],
    },
    {
      college: 'KNU참인재대학',
      department: ['KNU참인재대학'],
    },
    {
      college: '융복합전공',
      department: ['융복합전공'],
    },
  ],
};

const DONGA_COLLEGE_STATE = {
  id: 'donga',
  name: '동아대학교',
  webMail: 'https://mail.google.com/a/donga.ac.kr',
  state: [
    {
      college: '인문과학대학',
      department: [
        '철학생명의료윤리학과',
        '역사문화학부',
        '한국어문학과',
        '교육학과',
        '아동학과',
      ],
    },
    {
      college: '자연과학대학',
      department: ['정보수학과', '반도체학과', '화학과', '바이오메디컬학과'],
    },
    {
      college: '사회과학대학',
      department: [
        '정치사회학부',
        '행정학과',
        '사회복지학과',
        '미디어커뮤니케이션학과',
        '경제학과',
        '경찰학과',
      ],
    },
    {
      college: '경영대학',
      department: [
        '경영학과',
        '관광경영학과',
        '국제무역학과',
        '경영정보학과',
        '금융학과',
        '지식서비스경영학과',
        '융합경영학과',
      ],
    },
    {
      college: '생명자원과학대학',
      department: [
        '분자유전공학과',
        '응용생물공학과',
        '식품생명공학과',
        '생명자원산업학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '건축공학과',
        '도시공학과',
        '건설시스템공학과',
        '환경에너지공학부',
        '전기공학과',
        '전자공학과',
        '기계공학과',
        '산업경영공학과',
        '조선해양공학과',
        '화학공학과',
        '신소재공학과',
      ],
    },
    {
      college: '디자인환경대학',
      department: ['건축학과', '패션디자인학과', '조경학과', '산업디자인학과'],
    },
    {
      college: '예술체육대학',
      department: ['미술학과', '음악학과', '체육학과', '태권도학과'],
    },
    {
      college: '건강과학대학',
      department: ['식품영양학과', '의약생명공학과', '건강관리학과'],
    },
    {
      college: '의과대학',
      department: ['의예과'],
    },
    {
      college: '국제대학',
      department: ['글로벌비즈니스학과', '영미학과', '중국학과', '일본학과'],
    },
    {
      college: '기초교양대학',
      department: ['리버럴아츠전공'],
    },
    {
      college: '융합대학',
      department: ['자유전공학부', '융합전공'],
    },
    {
      college: '컴퓨터AI공학부',
      department: ['컴퓨터공학과', 'AI학과'],
    },
    {
      college: '석당인재학부',
      department: ['공공정책학전공'],
    },
    {
      college: '간호학부',
      department: ['간호학과'],
    },
  ],
};

const KYUNGNAM_COLLEGE_STATE = {
  id: 'kyungnam',
  name: '경남대학교',
  webMail: 'https://mail.kyungnam.ac.kr',
  state: [
    {
      college: '인문사회대학',
      department: [
        '한국어문학과',
        '역사학과',
        '영어학과',
        '중국학과',
        '디지털공연영상학과',
        '사회복지학과',
        '심리학과',
        '사회학과',
        '웹툰디자인학과',
        '문화유산복원예술학과',
      ],
    },
    {
      college: '건강보건대학',
      department: [
        '제약공학과',
        '화장품식품개발학부',
        '식품영양학과',
        '스포츠과학부',
        '의류산업학과',
        '간호학과',
        '물리치료학과',
        '외식조리학과',
        '작업치료학과',
        '보건의료정보학과',
        '응급구조학과',
      ],
    },
    {
      college: '사범대학',
      department: [
        '교육학과',
        '유아교육과',
        '국어교육과',
        '영어교육과',
        '일어교육과',
        '가정교육과',
        '수학교육과',
        '미술교육과',
        '음악교육과',
        '체육교육과',
      ],
    },
    {
      college: '경영대학',
      department: [
        '부동산경제금융학과',
        '무역물류학과',
        '경영학부',
        '경영학과',
        '여행항공관광학과',
        '디지털마케팅학과',
      ],
    },
    {
      college: '공공인재대학',
      department: [
        '법학과',
        '행정학과',
        '경찰학과',
        '정치외교학과',
        '미디어영상학과',
        '경호보안학과',
        '군사학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '기계공학부',
        '스마트기계융합공학과',
        '기계융합공학과',
        '전기공학과',
        '신소재공학과',
        '건축학부',
        '재난안전건설학과',
        '환경에너지공학과',
        '소방안전공학과',
        '조선해양시스템공학과',
      ],
    },
    {
      college: 'AI-SW융합대학',
      department: [
        '컴퓨터공학부',
        '전자SW공학과',
        '인공지능학과',
        '미래자동차학과',
        '게임학과',
      ],
    },
    {
      college: '창의융합대학',
      department: ['자유전공학부'],
    },
    {
      college: '미래라이프대학',
      department: [
        '평생교육상담보육학과',
        '로컬크리에이터학과',
        '여가라이프비즈니스학과',
        '비즈니스컨설팅학과',
        '토털뷰티디자인학과',
        '액티브시니어학과',
      ],
    },
  ],
};

const CAU_COLLEGE_STATE = {
  id: 'cau',
  name: '중앙대학교',
  webMail: 'https://portal.cau.ac.kr',
  state: [
    {
      college: '인문대학',
      department: [
        '국어국문학과',
        '영어영문학과',
        '유럽문화학부',
        '아시아문화학부',
        '철학과',
        '역사학과',
      ],
    },
    {
      college: '사회과학대학',
      department: [
        '정치국제학과',
        '공공인재학부',
        '심리학과',
        '문헌정보학과',
        '사회복지학부',
        '미디어커뮤니케이션학부',
        '도시계획부동산학과',
        '사회학과',
      ],
    },
    {
      college: '사범대학',
      department: ['교육학과', '유아교육과', '영어교육과', '체육교육과'],
    },
    {
      college: '자연과학대학',
      department: ['물리학과', '화학과', '생명과학과', '수학과'],
    },
    {
      college: '생명공학대학',
      department: ['생명자원공학부', '식품공학부', '시스템생명공학과'],
    },
    {
      college: '공과대학',
      department: [
        '건축학부',
        '사회기반시스템공학부',
        '화학공학과',
        '기계공학부',
        '에너지시스템공학부',
        '첨단소재공학과',
      ],
    },
    {
      college: '창의ICT대학',
      department: ['전자전기공학부', '융합공학부', '차세대반도체학과'],
    },
    {
      college: '소프트웨어대학',
      department: ['소프트웨어학부', 'AI학과'],
    },
    {
      college: '경영경제대학',
      department: [
        '경영학부',
        '경제학부',
        '응용통계학과',
        '광고홍보학과',
        '국제물류학과',
        '지식경영학부',
        '산업보안학과',
      ],
    },
    {
      college: '의과대학',
      department: ['의학부'],
    },
    {
      college: '약학대학',
      department: ['약학부'],
    },
    {
      college: '적십자간호대학',
      department: ['간호학과'],
    },
    {
      college: '예술대학',
      department: [
        '공연영상창작학부',
        '미술학부',
        '디자인학부',
        '음악학부',
        '전통예술학부',
        '글로벌예술학부',
      ],
    },
    {
      college: '예술공학대학',
      department: ['예술공학부'],
    },
    {
      college: '체육대학',
      department: ['스포츠과학부'],
    },
    {
      college: '교양대학',
      department: ['교양대학'],
    },
  ],
};

const HANYANG_ERICA_COLLEGE_STATE = {
  id: 'hanyang_erica',
  name: '한양대학교(ERICA)',
  webMail: 'https://gmail.com',
  state: [
    {
      college: '공과대학',
      department: [
        '건축학부',
        '건설환경공학과',
        '교통물류공학과',
        '전자공학부',
        '배터리소재화학공학과',
        '재료화학공학과',
        '기계공학과',
        '산업경영공학과',
        '생명나노공학과',
        '로봇공학과',
        '융합공학과',
        '국방정보공학과',
        '스마트융합공학부',
        '지능형로봇학과',
      ],
    },
    {
      college: '소프트웨어융합대학',
      department: ['컴퓨터학부', 'ICT융합학부', '인공지능학과', '융합전공'],
    },
    {
      college: '약학대학',
      department: ['약학과'],
    },
    {
      college: '과학기술융합대학',
      department: [
        '화학분자공학과',
        '해양융합공학과',
        '나노광전자학과',
        '수리데이터사이언스학과',
        '응용물리학과',
        '의약생명과학과',
      ],
    },
    {
      college: '첨단융합대학',
      department: [
        '바이오신약융합학부',
        '차세대반도체융합공학부',
        '국방지능정보융합공학부',
        '나노광전자학과',
        '생명나노공학과',
        '의약생명과학과',
        '응용물리학과',
      ],
    },
    {
      college: '국제문화대학',
      department: [
        '한국언어문학과',
        '문화인류학과',
        '문화콘텐츠학과',
        '중국학과',
        '일본학과',
        '영미언어문화학과',
        '프랑스학과',
      ],
    },
    {
      college: '언론정보대학',
      department: [
        '광고홍보학과',
        '정보사회미디어학과',
        '문화콘텐츠학과',
        '문화인류학과',
        '미디어인포매틱스학과',
      ],
    },
    {
      college: '경상대학',
      department: [
        '경제학부',
        '경영학부',
        '보험계리학과',
        '회계세무학과',
        '비즈니스애널리틱스융합전공',
        '응용경제학과',
        '경영컨설팅학과',
        '전략경영학과',
        '금융보험학과',
      ],
    },
    {
      college: '디자인대학',
      department: [
        '융합디자인학부',
        '주얼리패션디자인학과',
        '산업디자인학과',
        '커뮤니케이션디자인학과',
        '영상디자인학과',
      ],
    },
    {
      college: '예체능대학',
      department: ['스포츠과학부', '무용예술학과', '실용음악학과'],
    },
    {
      college: 'LIONS칼리지',
      department: ['자율전공'],
    },
  ],
};

const CHANGWON_COLLEGE_STATE = {
  id: 'changwon',
  name: '창원대학교',
  webMail: 'https://mail.gs.cwnu.ac.kr',
  state: [
    {
      college: '인문대학',
      department: [
        '국어국문학과',
        '영어영문학과',
        '독어독문학과',
        '불어불문학과',
        '일어일문학과',
        '사학과',
        '철학과',
        '특수교육과',
        '유아교육과',
      ],
    },
    {
      college: '사회과학대학',
      department: [
        '법학과',
        '행정학과',
        '국제관계대학',
        '중국학과',
        '사회학과',
        '미디어커뮤니케이션학과',
        '사회복지학과',
      ],
    },
    {
      college: '경영대학',
      department: [
        '글로벌비즈니스학부',
        '국제무역학과',
        '경영학과',
        '회계학과',
        '세무학과',
      ],
    },
    {
      college: '자연과학대학',
      department: [
        '수학과',
        '반도체물리학과',
        '생물학화학융합학부',
        '통계학과',
        '생명보건학부',
        '의류학과',
        '식품영양학과',
        '체육학과',
        '간호학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '산업시스템공학과',
        '스마트오션모빌리티공학과',
        '환경에너지공학전공',
        '화학공학전공',
        '건설시스템공학전공',
        '건축학전공',
        '건축공학전공',
        '컴퓨터공학과',
        '정보통신공학과',
        '조선해양공학과',
      ],
    },
    {
      college: '메카트로닉스학과',
      department: ['기계공학부', '전기전자제어공학부', '신소재공학부'],
    },
    {
      college: '예술대학',
      department: ['음악과', '미술학과', '산업디자인학과', '무용학과'],
    },
    {
      college: '미래융합대학',
      department: [
        '신산업융합경영학과',
        '메카융합공학과',
        '빅데이터자산관리학과',
        '빅데이터창업비즈니스학과',
        '스마트헬스케어학과',
        '문화테크노학과',
        '에너지융합공학과',
      ],
    },
    {
      college: '글로벌첨단과학기술대학',
      department: [
        '공학융합학부',
        '이학융합학부',
        '스마트제조융합전공',
        '우주항공공학부',
      ],
    },
  ],
};

const HANSUNG_COLLEGE_STATE = {
  id: 'hansung',
  name: '한성대학교',
  webMail: 'https://mail.hansung.ac.kr/',
  state: [
    {
      college: '크리에이티브인문예술대학',
      department: ['크리에이티브인문학부'],
    },
    {
      college: '미래융합사회과학대학',
      department: ['사회과학부'],
    },
    {
      college: '디자인대학',
      department: [
        '글로벌패션산업학부',
        'ICT디자인학부',
        '뷰티디자인매니지먼트학과',
      ],
    },
    {
      college: 'IT공과대학',
      department: [
        '컴퓨터공학부',
        '기계전자공학부',
        'IT융합공학부',
        '산업시스템공학부',
        '스마트제조혁신컨설팅학과',
      ],
    },
    {
      college: '창의융합대학',
      department: [
        '상상력인재학부',
        '문학문화콘텐츠학과',
        'AI응용학과',
        '융합보안학과',
        '미래모빌리티학과',
      ],
    },
    {
      college: '미래플러스대학',
      department: [
        '융합행정학과',
        '호텔외식경영학과',
        '뷰티디자인학과',
        '비즈니스컨설팅학과',
        'ICT융합디자인학과',
        '미래인재학부',
      ],
    },
    {
      college: '상상력교양대학',
      department: ['기초교양학부', '소양핵심교양학부', '자율교양학부'],
    },
  ],
};

const CSU_COLLEGE_STATE = {
  id: 'csu',
  name: '총신대학교',
  webMail: 'https://mail.chongshin.ac.kr',
  state: [
    {
      college: '신학부',
      department: ['신학과', '교회음악과'],
    },
    {
      college: '사범학부',
      department: [
        '기독교교육과',
        '영어교육과',
        '역사교육과',
        '유아교육과',
        '교직과',
      ],
    },
    {
      college: '사회과학학부',
      department: ['아동학과', '사회복지학과', '중독상담학과'],
    },
    {
      college: '산업교육학부',
      department: ['아동학과', '아동상담심리학과'],
    },
    {
      college: '호크마교양교육원',
      department: ['호크마교양교육원'],
    },
  ],
};

const KMA_COLLEGE_STATE = {
  id: 'kma',
  name: '육군사관학교',
  webMail: 'https://gmail.com',
  state: [
    {
      college: '사회과학처',
      department: ['정치사회학과', '경제법학과', '심리경영학과', '군사사학과'],
    },
    {
      college: '인문과학처',
      department: ['국어철학과', '영어과', '외국어학과'],
    },
    {
      college: '이학처',
      department: ['수학과', '물리화학과', '컴퓨터과학과', 'AI데이터과학과'],
    },
    {
      college: '공학처',
      department: ['기계시스템공학과', '전자공학과', '토목환경학과'],
    },
    {
      college: '체육학처',
      department: ['체육학처'],
    },
    {
      college: '군사훈련처',
      department: ['군사훈련처'],
    },
  ],
};

const SOGANG_COLLEGE_STATE = {
  id: 'sogang',
  name: '서강대학교',
  webMail: 'https://ucloud.sogang.ac.kr/t/u.sogang.ac.kr',
  state: [
    {
      college: '인문대학',
      department: [
        '국어국문학과',
        '사학과',
        '철학과',
        '종교학과',
        '영문학부',
        '유럽문화학과',
        '중국문화학과',
        '일본문화연계전공',
        '교육문화연계전공',
        '디지털인문학연계전공',
      ],
    },
    {
      college: '사회과학대학',
      department: ['사회학과', '정치외교학과', '심리학과'],
    },
    {
      college: '지식융합미디어대학',
      department: [
        '신문방송학과',
        '미디어엔터테인먼트학과',
        '아트테크놀로지학과',
      ],
    },
    {
      college: '자연과학대학',
      department: ['수학과', '물리학과', '화학과', '생명과학과'],
    },
    {
      college: '공과대학',
      department: [
        '전자공학과',
        '화공생명공학과',
        '기계공학과',
        '시스템반도체공학과',
      ],
    },
    {
      college: '경제대학',
      department: ['경제학과'],
    },
    {
      college: '로욜라국제대학',
      department: ['글로벌한국학부', '게페르트국제학부', '글로벌융합학부'],
    },
    {
      college: '소프트웨어융합대학',
      department: ['컴퓨터공학과', '인공지능학과'],
    },
  ],
};

const SYU_COLLEGE_STATE = {
  id: 'syu',
  name: '삼육대학교',
  webMail: 'https://gmail.com',
  state: [
    {
      college: '신학대학',
      department: ['신학과'],
    },
    {
      college: '간호대학',
      department: ['간호학과'],
    },
    {
      college: '약학대학',
      department: ['약학과'],
    },
    {
      college: '창의융합대학',
      department: [
        '경영학과',
        '글로벌한국학과',
        '영어영문학과',
        '상담심리학과',
        '유아교육과',
        '항공관광외국어학부',
        '사회복지학과',
        '음악학과',
        '아트앤디자인학과',
        '체육학과',
      ],
    },
    {
      college: '미래융합대학',
      department: [
        '물리치료학과',
        '보건관리학과',
        '식품영양학과',
        '동물자원과학과',
        '바이오융합공학과',
        '화학생명과학과',
        '환경디자인원예학과',
        '인공지능융합학부',
        '컴퓨터공학부',
        '건축학과',
        '데이터클라우드공학과',
      ],
    },
    {
      college: '스마트학부대학',
      department: ['스마트학부대학'],
    },
  ],
};

const JNUE_COLLEGE_STATE = {
  id: 'jnue',
  name: '전주교육대학교',
  webMail: 'https://portal.jnue.kr',
  state: [
    {
      college: '전주교육대학교',
      department: [
        '윤리교육과',
        '국어교육과',
        '사회교육과',
        '수학교육과',
        '과학교육과',
        '실과교육과',
        '음악교육과',
        '미술교육과',
        '체육교육과',
        '초등교육과',
        '영어교육과',
        '컴퓨터교육과',
      ],
    },
  ],
};

const BU_COLLEGE_STATE = {
  id: 'bu',
  name: '백석대학교',
  webMail: 'https://portal.bu.ac.kr',
  state: [
    {
      college: '기독교학부',
      department: [
        '신학전공',
        '기독교교육학전공',
        '기독교상담학전공',
        '미디어선교학전공',
        '기독교문화콘텐츠전공',
      ],
    },
    {
      college: '어문학부',
      department: [
        '국어국문학전공',
        '영어학전공',
        '중국어학전공',
        '일본어학전공',
      ],
    },
    {
      college: '사회복지학부',
      department: [
        '사회복지학전공',
        '아동복지학전공',
        '노인복지학전공',
        '청소년학전공',
      ],
    },
    {
      college: '경찰학부',
      department: [
        '경찰행정학전공',
        '법학전공',
        '경찰범죄수사학전공',
        '범죄교정학전공',
        '행정학전공',
      ],
    },
    {
      college: '경상학부',
      department: ['경영학전공', '회계학전공', '국제통상학전공'],
    },
    {
      college: '관광학부',
      department: [
        '관광경영학전공',
        '호텔경영학전공',
        '항공서비스전공',
        '글로벌호텔비즈니스전공',
      ],
    },
    {
      college: '사범학부',
      department: [
        '유아교육과',
        '특수교육과',
        '유아특수교육과',
        '특수체육교육과',
      ],
    },
    {
      college: '컴퓨터공학부',
      department: [
        '소프트웨어학전공',
        '멀티미디어학전공',
        '정보통신학전공',
        '인공지능학전공',
      ],
    },
    {
      college: '보건학부',
      department: [
        '물리치료학과',
        '치위생학과',
        '안경광학과',
        '작업치료학과',
        '응급구조학과',
      ],
    },
    {
      college: '간호학과',
      department: ['간호학과'],
    },
    {
      college: '디자인영상학부',
      department: [
        '시각디자인전공',
        '산업디자인전공',
        '인테리어디자인전공',
        '영상애니메이션전공',
        '문화상품디자인전공',
      ],
    },
    {
      college: '스포츠과학부',
      department: ['스포츠건강관리전공', '스포츠경영전공', '태권도전공'],
    },
    {
      college: '문화예술학부',
      department: ['피아노전공', '뮤지컬전공', '실용음악전공', '연기예술전공'],
    },
    {
      college: '혁신융합학부',
      department: [
        '컴퓨터융합전공',
        '소셜비즈니스융합전공',
        '글로벌MICE융합전공',
        '빅데이터융합전공',
        'ARVR융합전공',
        '글로벌IT융합전공',
      ],
    },
    {
      college: '첨단IT학부',
      department: ['ARVR전공', '빅데이터전공', '핀테크전공', 'IoT전공'],
    },
    {
      college: '외식산업학부',
      department: ['호텔외식조리전공', '제과제빵전공'],
    },
    {
      college: '자유전공학부',
      department: ['자유전공학부'],
    },
  ],
};

const MJC_COLLEGE_STATE = {
  id: 'mjc',
  name: '명지전문대학교',
  webMail: 'https://mail.mjc.ac.kr',
  state: [
    {
      college: '공학정보학부',
      department: [
        '산업경영공학과',
        '기계공학과',
        '토목공학과',
        '지적공간정보학과',
        '전기공학과',
        '전자공학과',
        '컴퓨터공학과',
        '정보통신공학과',
        '소프트웨어콘텐츠과',
        '인터넷보안공학과',
        '드론정보공학과',
      ],
    },
    {
      college: '경영사회학부',
      department: [
        '경영학과',
        '세무회계과',
        '부동산경영과',
        '사회복지과',
        '행정과',
        '공공행정서비스상담과',
      ],
    },
    {
      college: '어문교육학부',
      department: [
        '항공서비스과',
        '중국어비즈니스과',
        '일본어과',
        '문예창작과',
        '유아교육학과',
        '청소년교육상담과',
      ],
    },
    {
      college: '예술건강학부',
      department: [
        '산업디자인학과',
        '패션리빙디자인과',
        '커뮤니케이션디자인과',
        '공연예술학부',
        '실용음악과',
        '사회체육과',
        '연극영상학과',
        '뷰티매니지먼트과',
        '보건의료정보과',
      ],
    },
    {
      college: '미래융합학부',
      department: [
        '드론공학과',
        '엔터융합비즈니스과',
        '뷰티패션융합과',
        '세무회계융합과',
        '사회서비스상담복지과',
        '문헌정보과',
      ],
    },
    {
      college: '자유전공학부',
      department: ['자유전공학부'],
    },
    {
      college: '조기취업형계약학과',
      department: [
        '스마트건설공학과',
        'AI빅데이터학과',
        '디지털콘텐츠융합과',
        '헤어메이크업과',
        '스파메디컬스킨케어과',
        '뮤직콘텐츠기획과',
      ],
    },
  ],
};

const KW_COLLEGE_STATE = {
  id: 'kw',
  name: '광운대학교',
  webMail: 'https://wmail.kw.ac.kr/',
  state: [
    {
      college: '전자정보공학대학',
      department: [
        '전자공학과',
        '전자통신공학과',
        '전자융합공학과',
        '전기공학과',
        '전자재료공학과',
        '반도체시스템공학과',
      ],
    },
    {
      college: '인공지능융합대학',
      department: [
        '컴퓨터정보공학부',
        '소프트웨어학부',
        '정보융합학부',
        '로봇학부',
        '지능형로봇학과',
      ],
    },
    {
      college: '공과대학',
      department: ['건축공학과', '화학공학과', '환경공학과', '건축학과'],
    },
    {
      college: '자연과학대학',
      department: [
        '수학과',
        '전자바이오물리학과',
        '화학과',
        '스포츠융합과학과',
        '정보콘텐츠학과',
      ],
    },
    {
      college: '인문사회과학대학',
      department: ['국어국문학과', '영어산업학과', '미디어커뮤니케이션학부'],
    },
    {
      college: '정책법학대학',
      department: ['행정학과', '법학부', '국제학부', '자산관리학과'],
    },
    {
      college: '경영대학',
      department: ['경영학부', '국제통상학부'],
    },
    {
      college: '참빛인재대학',
      department: [
        '금융보안산업학과',
        '스마트전자전학과',
        '게임콘텐츠학과',
        '스포츠상담재활학과',
      ],
    },
  ],
};

const GJUE_COLLEGE_STATE = {
  id: 'gjue',
  name: '공주교육대학교',
  webMail: 'https://portal.gjue.ac.kr',
  state: [
    {
      college: '공주교육대학교',
      department: [
        '국어교육과',
        '윤리교육과',
        '사회과교육과',
        '수학교육과',
        '과학교육과',
        '실과교육과',
        '체육교육과',
        '음악교육과',
        '미술교육과',
        '영어교육과',
        '교육학과',
        '컴퓨터교육과',
      ],
    },
  ],
};

const KONKUK_COLLEGE_STATE = {
  id: 'konkuk',
  name: '건국대학교',
  webMail: 'https://portal.konkuk.ac.kr/',
  state: [
    {
      college: '디자인대학',
      department: [
        '산업디자인학과',
        '실내디자인학과',
        '패션디자인학과',
        '시각영상디자인학과',
        '미디어콘텐츠학과',
        '조형예술학과',
      ],
    },
    {
      college: '인문사회융합대학',
      department: [
        '경영학과',
        '경제통상학과',
        '경찰학과',
        '소방방재융합학과',
        '문헌정보학과',
        '유아교육과',
        '사회복지학과',
        '신문방송학과',
        '동화한국어문학학과',
        '영어문화학과',
      ],
    },
    {
      college: '과학기술대학',
      department: [
        '메카트로닉스공학과',
        '컴퓨터공학과',
        '바이오메디컬공학과',
        '녹색기술융합학과',
        '에너지신소재공학과',
      ],
    },
    {
      college: '의료생명대학',
      department: [
        '간호학과',
        '바이오의약학과',
        '생명공학과',
        '식품영양학과',
        '뷰티화장품학과',
        '스포츠건강학과',
        '골프산업학과',
      ],
    },
    {
      college: '의과대학',
      department: ['의학과'],
    },
  ],
};

const SUNMOON_COLLEGE_STATE = {
  id: 'sunmoon',
  name: '선문대학교',
  webMail: 'https://gmail.com',
  state: [
    {
      college: '인문사회대학',
      department: [
        '사학과',
        '디지털콘텐츠학부',
        '법경찰학과',
        '상담심리학과',
        '사회복지학과',
        '미디어커뮤니케이션학부',
        '한국문화콘텐츠창작학과',
        '글로벌한국어교육학과',
        '행정공기업학과',
      ],
    },
    {
      college: '글로벌비즈니스대학',
      department: [
        '외국어학부',
        '국제관계학과',
        '경영학과',
        '글로벌경제학과',
        'IT경영학과',
        '글로벌관광학부',
      ],
    },
    {
      college: '신학대학',
      department: ['신학과'],
    },
    {
      college: '건강보건대학',
      department: [
        '수산생명의학과',
        '식품공학영양학부',
        '제약화장품학과',
        '간호학과',
        '물리치료학과',
        '치위생학과',
        '응급구조학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '건축학부',
        '기계공학과',
        '반도체소재공학과',
        '산업안전경영공학과',
        '소방방재안전학과',
        '신소재공학과',
        '에너지화학공학과',
        '건설시스템안전공학과',
      ],
    },
    {
      college: '특화산업융합대학',
      department: [
        '미래자동차공학부',
        '전자공학과',
        'AI소프트웨어학과',
        '컴퓨터공학부',
        '스마트정보통신공학과',
        '디스플레이반도체공학과',
      ],
    },
    {
      college: '예술체육대학',
      department: ['무도학부', '스포츠과학부', '디자인학부', '영화영상학과'],
    },
    {
      college: '자유전공대학',
      department: ['글로벌자유전공학부', '자유전공학부'],
    },
    {
      college: '소프트웨어융합대학',
      department: ['IT교육학부', '소프트웨어융합학부'],
    },
    {
      college: '이니티움교양대학',
      department: [
        '이니티움교양대학',
        '교양학부',
        '글로벌어학부',
        '산학협력교육학부',
        '이니티움교양센터',
        '외국어교육원',
      ],
    },
  ],
};

const HOSEO_COLLEGE_STATE = {
  id: 'hoseo',
  name: '호서대학교',
  webMail: 'https://intranet.hsu.ac.kr/',
  state: [
    {
      college: '인문사회대학',
      department: [
        '기독교학과',
        '한국어문화학과',
        '영어영문학과',
        '중국학과',
        '법경찰행정학과',
        '사회복지학부',
        '사회복지트랙',
        '노인복지트랙',
        '청소년문화상담학과',
        '유아교육과',
        '항공서비스학과',
        '산업심리학과',
        '미디어커뮤니케이션학과',
      ],
    },
    {
      college: '경영대학',
      department: [
        '글로벌통상학과',
        '경영학부',
        '경영학트랙',
        '세무회계트랙',
        '디지털금융경영학과',
      ],
    },
    {
      college: '생명보건대학',
      department: [
        '식품공학과',
        '제약공학과',
        '화장품과학과',
        '생명공학과',
        '식품영양학과',
        '간호학과',
        '물리치료학과',
        '임상병리학과',
        '동물보건복지학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '전기공학과',
        '시스템제어공학과',
        '기계공학과',
        '미래자동차학과',
        '화학공학과',
        '안전공학과',
        '소방방재학과',
        '건축학과',
        '건축토목공학부',
        '건축공학트랙',
        '토목공학트랙',
        '환경공학과',
        '정보통신공학과',
        '정보통신공학트랙',
        '해양IT공학트랙',
        '자동차ICT공학과',
        '신소재공학과',
        '전자제어공학과',
      ],
    },
    {
      college: 'AI융합대학',
      department: [
        '빅데이터학부',
        '빅데이터분석트랙',
        'AI융합비즈니스트랙',
        '컴퓨터공학부',
        '사물인터넷트랙',
        '인공지능트랙',
        '정보보호학트랙',
        '게임소프트웨어학과',
        '지능로봇학과',
        '전자공학과',
        '반도체공학과',
      ],
    },
    {
      college: '예체능대학',
      department: [
        '사회체육학과',
        '골프산업학과',
        '시간디자인학과',
        '산업디자인학과',
        '디지털프로덕트디자인학과',
        '실내디자인학과',
        '문화영상학부',
        '영상미디어트랙',
        '문화콘텐츠기획트랙',
        '애니메이션학과',
        '공연예술학부',
        '실용음악트랙',
        '연극트랙',
      ],
    },
    {
      college: '미래융합대학',
      department: [
        '사회복지상담학과',
        '산업안전공학과',
        '스마트경영학과',
        '기계반도체공학과',
      ],
    },
    {
      college: '더함교양대학',
      department: ['창의교양학부', '혁신융합학부'],
    },
  ],
};

const TUKOREA_COLLEGE_STATE = {
  id: 'tukorea',
  name: '한국공학대학교',
  webMail: 'https://ksc.tukorea.ac.kr/sso/login_stand.jsp',
  state: [
    {
      college: 'SW대학',
      department: ['SW대학', '컴퓨터공학부', '게임공학과', '인공지능학과'],
    },
    {
      college: 'IT반도체융합대학',
      department: ['전자공학부', '나노반도체공학과'],
    },
    {
      college: '스마트기계융합대학',
      department: ['기계공학과', '기계설계공학부', '메카트로닉스공학부'],
    },
    {
      college: '첨단융합대학',
      department: ['신소재공학과', '생명화학공학과', '에너지·전기공학과'],
    },
    {
      college: '미래대학',
      department: ['자유전공학부', '융합전공', '마이크로디그리'],
    },
    {
      college: '경영학부',
      department: ['경영학부'],
    },
    {
      college: '디자인공학부',
      department: ['디자인공학부'],
    },
    {
      college: '지식융합학부',
      department: ['지식융합학부'],
    },
    {
      college: '글로벌융합공학과',
      department: ['글로벌융합공학과'],
    },
  ],
};

const PTU_COLLEGE_STATE = {
  id: 'ptu',
  name: '평택대학교',
  webMail: 'https://mail.ptu.ac.kr/',
  state: [
    {
      college: 'IT공과대학',
      department: [
        '스마트빌리티학과',
        '지능형반도체학과',
        '융합소프트웨어학과',
        '정보통신학과',
        '데이터정보학과',
        'ICT융합학부',
        '미디어디자인학과',
        '스마트콘텐츠학과',
      ],
    },
    {
      college: '국제물류대학',
      department: ['국제물류학과', '국제무역행정학과', '도시계획부동산학과'],
    },
    {
      college: '사회서비스대학',
      department: [
        '사회복지학과',
        '재활상담학과',
        '아동청소년교육상담학과',
        '간호학과',
      ],
    },
    {
      college: '문화예술대학',
      department: [
        '커뮤니케이션디자인학과',
        '패션디자인및브랜딩학과',
        '연극영화과',
        '실용음악학과',
        '음악학과',
      ],
    },
    {
      college: '글로벌자율전공학부',
      department: ['글로벌자율전공학부'],
    },
    {
      college: '피어선칼리지',
      department: ['피어선칼리지'],
    },
    {
      college: '피어선교양전공',
      department: ['피어선교양전공'],
    },
    {
      college: '융복합전공',
      department: [
        '글로벌리더스융복합전공',
        '다문화복지융복합전공',
        '다문화한국어교육융복합전공',
        '스토리텔링융복합전공',
        '창업융복합전공',
        '초협업융복합전공',
      ],
    },
    {
      college: '사회맞춤형 융복합전공(LINC+)',
      department: [
        '스마트물류융복합전공',
        '스마트반도체시스템융복합전공',
        '산업IoT융복합전공',
        '스마트재활케어융복합전공',
      ],
    },
  ],
};

const JBNU_COLLEGE_STATE = {
  id: 'jbnu',
  name: '전북대학교',
  webMail: 'https://mail.jbnu.ac.kr/',
  state: [
    {
      college: '간호대학',
      department: ['간호학과'],
    },
    {
      college: '경상대학',
      department: ['경영학과', '경제학부', '무역학과', '회계학과'],
    },
    {
      college: '공과대학',
      department: [
        'IT정보공학과',
        'IT지능정보공학과',
        '건축공학과',
        '고분자섬유나노공학부',
        '기계공학과',
        '기계설계공학부',
        '기계시스템공학부',
        '도시공학과',
        '바이오메디컬공학과',
        '사회기반공학과',
        '산업정보시스템공학과',
        '소프트웨어공학과',
        '신소재공학부',
        '양자시스템공학과',
        '융합기술공학부',
        '전기공학과',
        '전자공학부',
        '컴퓨터공학부',
        '컴퓨터인공지능학부',
        '토목환경자원에너지공학부',
        '항공우주공학과',
        '화학공학부',
      ],
    },
    {
      college: '글로벌융합대학',
      department: [
        '공공인재학부',
        '국제이공학부',
        '국제인문사회학부',
        '융합학부',
      ],
    },
    {
      college: '농업생명과학대학',
      department: [
        '농경제유통학부',
        '농생물학과',
        '동물생명공학과',
        '동물자원과학과',
        '목재응용과학과',
        '산림환경과학과',
        '생명자원융합학과',
        '생물산업기계공학과',
        '생물환경화학과',
        '식품공학과',
        '원예학과',
        '작물생명과학과',
        '조경학과',
        '지역건설공학과',
      ],
    },
    {
      college: '스마트팜학과',
      department: ['스마트팜학과'],
    },
    {
      college: '한옥학과',
      department: ['한옥학과'],
    },
    {
      college: '사범대학',
      department: [
        '국어교육과',
        '물리교육전공',
        '생물교육전공',
        '지구과학교육전공',
        '화학교육전공',
        '교육학과',
        '독어교육과',
        '수학교육과',
        '역사교육과',
        '영어교육과',
        '윤리교육과',
        '일반사회교육과',
        '지리교육과',
        '체육교육과',
      ],
    },
    {
      college: '사회과학대학',
      department: [
        '미디어커뮤니케이션학과',
        '사회복지학과',
        '사회학과',
        '심리학과',
        '정치외교학과',
        '행정학과',
      ],
    },
    {
      college: '생활과학대학',
      department: ['식품영양학과', '아동학과', '의류학과', '주거환경학과'],
    },
    {
      college: '수의과대학',
      department: ['수의예과', '수의학과'],
    },
    {
      college: '약학대학',
      department: ['약학과'],
    },
    {
      college: '예술대학',
      department: [
        '무용학과',
        '미술학과',
        '산업디자인학과',
        '음악과',
        '한국음악학과',
      ],
    },
    {
      college: '의과대학',
      department: ['의예과'],
    },
    {
      college: '인문대학',
      department: [
        '고고문화인류학과',
        '국어국문학과',
        '독일학과',
        '문헌정보학과',
        '사학과',
        '스페인중남미학과',
        '영어영문학과',
        '일본학과',
        '중어중문학과',
        '철학과',
        '프랑스아프리카학과',
      ],
    },
    {
      college: '자연과학대학',
      department: [
        '과학학과',
        '물리학과',
        '반도체과학기술학부',
        '분자생물학과',
        '생명과학과',
        '수학과',
        '스포츠과학과',
        '지구환경과학과',
        '통계학과',
        '화학과',
      ],
    },
    {
      college: '치과대학',
      department: ['치의예과'],
    },
    {
      college: '환경생명자원대학',
      department: ['생명공학부', '생태조경디자인학과', '한약자원학과'],
    },
  ],
};

const KOOKMIN_COLLEGE_STATE = {
  id: 'kookmin',
  name: '국민대학교',
  webMail: 'https://apps.kookmin.ac.kr/',
  state: [
    {
      college: '글로벌인문·지역대학',
      department: ['한국어문학부', '중국학부'],
    },
    {
      college: '사회과학대학',
      department: [
        '행정학과',
        '정치외교학과',
        '사회학과',
        '미디어광고학부',
        '교육학과',
        '러시아유라시아학과',
        '일본학과',
      ],
    },
    {
      college: '법과대학',
      department: ['법학부', '기업융합법학과'],
    },
    {
      college: '경상대학',
      department: ['경제학과', '국제통상학과'],
    },
    {
      college: '창의공과대학',
      department: [
        '신소재공학부',
        '기계공학부',
        '건설시스템공학부',
        '전자공학부',
      ],
    },
    {
      college: '조형대학',
      department: [
        '공업디자인학과',
        '시각디자인학과',
        '금속공예학과',
        '도자공예학과',
        '의상디자인학과',
        '공간디자인학과',
        '영상디자인학과',
        '자동차운송디자인학과',
        'AID디자인학과',
      ],
    },
    {
      college: '과학기술대학',
      department: [
        '산림환경시스템학과',
        '나노전자물리학과',
        '입자생명공학과',
        '응용화학부',
        '식품영양학과',
        '정보보안암호수학과',
        '바이오발효융합학과',
      ],
    },
    {
      college: '예술대학',
      department: ['음악학부', '미술학부', '공연예술학부'],
    },
    {
      college: '체육대학',
      department: [
        '스포츠교육학과',
        '스포츠산업레저학과',
        '스포츠건강재활학과',
      ],
    },
    {
      college: '경영대학',
      department: [
        '경영학부',
        '기업경영학부',
        '경영정보학부',
        '재무금융회계학부',
        'KIBS',
        'AI빅데이터융합경영학과',
      ],
    },
    {
      college: '소프트웨어융합대학',
      department: ['소프트웨어학부', '인공지능학부'],
    },
    {
      college: '건축대학',
      department: ['건축학부'],
    },
    {
      college: '자동차융합대학',
      department: ['자동차공학과', '미래자동차학부', '자동차IT융합학과'],
    },
    {
      college: '미래모빌리티학과',
      department: ['미래모빌리티학과'],
    },
    {
      college: '교양대학',
      department: ['교직과정부', '인문기술융합학부'],
    },
  ],
};

const SEOULTECH_COLLEGE_STATE = {
  id: 'seoultech',
  name: '서울과학기술대학교',
  webMail: 'https://portal.seoultech.ac.kr/',
  state: [
    {
      college: '공과대학',
      department: [
        '기계시스템디자인공학과',
        '기계자동차공학과',
        '안전공학과',
        '신소재공학과',
        '건설시스템공학과',
        '건축학부',
      ],
    },
    {
      college: '정보통신대학',
      department: [
        '전기정보공학과',
        '전자공학과',
        '컴퓨터공학과',
        '스마트ICT융합공학과',
      ],
    },
    {
      college: '에너지바이오대학',
      department: [
        '화공생명공학과',
        '환경공학과',
        '식품생명공학과',
        '정밀화학과',
        '스포츠과학과',
        '안경광학과',
      ],
    },
    {
      college: '조형대학',
      department: [
        '디자인학과',
        '도예과',
        '금속공예디자인학과',
        '조형예술학과',
      ],
    },
    {
      college: '인문사회대학',
      department: ['행정학과', '영어영문학과', '문예창작학과'],
    },
    {
      college: '기술경영융합대학',
      department: ['산업공학', 'MSDE학과', '경영학부'],
    },
    {
      college: '미래융합대학',
      department: [
        '융합기계공학과',
        '건설환경융합공학과',
        '헬스피트니스학과',
        '문화예술학과',
        '영어과',
        '벤처경영학과',
        '정보통신융합공학과',
      ],
    },
    {
      college: '창의융합대학',
      department: [
        '인공지능융합학과',
        '지능형반도체공학과',
        '미래에너지융합학과',
      ],
    },
    {
      college: '교양대학',
      department: ['인문사회교양학부', '자연과학부', '융합교양학부'],
    },
    {
      college: '국제대학',
      department: [
        '글로벌한국어문화학부',
        '글로벌비즈니스학부',
        '글로벌기초교육학부',
      ],
    },
  ],
};

const SMU_SEOUL_COLLEGE_STATE = {
  id: 'smu_seoul',
  name: '상명대학교(서울)',
  webMail: 'https://portal.smu.ac.kr',
  state: [
    {
      college: '인문사회과학대학',
      department: [
        '공간환경학부',
        '행정학부',
        '가족복지학과',
        '국가안보학과',
        '역사콘텐츠전공',
        '지적재산전공',
        '문헌정보학전공',
      ],
    },
    {
      college: '사범대학',
      department: ['국어교육과', '영어교육과', '교육학과', '수학교육과'],
    },
    {
      college: '경영경제대학',
      department: [
        '경제금융학부',
        '경영학부',
        '글로벌경영학과',
        '융합경영학과',
      ],
    },
    {
      college: '융합공과대학',
      department: [
        '휴먼지능정보공학전공',
        '핀테크전공',
        '빅데이터융합전공',
        '스마트생산전공',
        '컴퓨터과학전공',
        '전기공학전공',
        '지능IoT융합전공',
        '게임전공',
        '애니메이션전공',
        '한일문화콘텐츠전공',
        '생명공학전공',
        '화학에너지공학전공',
        '화공신소재전공',
      ],
    },
    {
      college: '문화예술대학',
      department: [
        '식품영양학전공',
        '의류학전공',
        '스포츠건강관리전공',
        '무용예술전공',
        '회화예술전공',
        '생활예술전공',
      ],
    },
    {
      college: '음악학부',
      department: ['음악학부'],
    },
  ],
};

const SMU_CHEONAN_COLLEGE_STATE = {
  id: 'smu_cheonan',
  name: '상명대학교(천안)',
  webMail: 'https://portal.smu.ac.kr',
  state: [
    {
      college: '글로벌인문학부대학',
      department: [
        '한국언어문화전공',
        '일본어지역학전공',
        '중국어지역학전공',
        '영어지역학전공',
        '프랑스어지역학전공',
        '독일어지역학전공',
        '러시아중앙아시아지역학전공',
      ],
    },
    {
      college: '디자인대학',
      department: [
        '커뮤니케이션디자인전공',
        '패션디자인전공',
        '텍스타일디자인전공',
        '스페이스디자인전공',
        '세라믹디자인전공',
        '인더스트리얼디자인전공',
        'ARVR미디어디자인전공',
      ],
    },
    {
      college: '예술대학',
      department: [
        '영화영상전공',
        '연극전공',
        '무대미술전공',
        '사진영상미디어전공',
        '디지털문화영상전공',
        '문화예술경영전공',
        '디지털콘텐츠전공',
      ],
    },
    {
      college: '융합기술대학',
      department: [
        '글로벌금융경영학부',
        '식품공학과',
        '그린스마트시티학과',
        '간호학과',
        '스포츠경영전공',
        '사회체육전공',
      ],
    },
    {
      college: '공과대학',
      department: [
        '전자공학과',
        '소프트웨어학과',
        '스마트정보통신공학과',
        '경영공학과',
        '그린화학공학과',
        '건설시스템공학과',
        '정보보안공학과',
        '시스템반도체공학과',
        '휴먼지능로봇공학과',
        '지능형로봇학과',
      ],
    },
  ],
};

const MJU_COLLEGE_STATE = {
  id: 'mju',
  name: '명지대학교',
  webMail: 'https://portal.mju.ac.kr',
  state: [
    {
      college: '인문대학',
      department: [
        '국어국문학과',
        '중어중문학과',
        '영어영문학과',
        '일어일문학과',
        '사학과',
        '아랍지역학과',
        '미술사학과',
        '철학과',
        '문헌정보학과',
        '글로벌한국학과',
        '글로벌인문사회학과',
      ],
    },
    {
      college: '사회과학대학',
      department: [
        '행정학과',
        '경제학과',
        '정치외교학과',
        '디지털미디어학과',
        '아동학과',
        '청소년지도학과',
      ],
    },
    {
      college: '경영대학',
      department: [
        '경영학과',
        '국제통상학과',
        '경영정보학과',
        '부동산학과',
        '경영교육혁신센터',
      ],
    },
    {
      college: '법과대학',
      department: ['법학과', '법무경찰학과'],
    },
    {
      college: 'ICT융합대학',
      department: [
        '디지털콘텐츠디자인학과',
        '융합소프트웨어학부',
        '정보통신공학과',
      ],
    },
    {
      college: '미래융합대학',
      department: [
        '창의융합인재학부',
        '사회복지학과',
        '부동산학과',
        '법무경찰학과',
        '심리치료학과',
        '미래환경에너지학과',
        '멀티디자인학과',
        '회계세무학과',
        '계약학과',
      ],
    },
    {
      college: '자연과학대학',
      department: [
        '수학과',
        '물리학과',
        '화학과',
        '식품영양학과',
        '생명과학정보학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '전기공학과',
        '전자공학과',
        '반도체공학과',
        '화학공학과',
        '신소재공학과',
        '환경에너지공학과',
        '컴퓨터공학과',
        '정보보안학과',
        '토목환경공학과',
        '건축공학과',
        '기계공학과',
        '산업경영공학과',
        '공학교육혁신센터',
      ],
    },
    {
      college: '예술체육대학',
      department: ['디자인학부', '스포츠학부', '바둑학과', '예술학부'],
    },
    {
      college: '건축대학',
      department: ['건축학부'],
    },
    {
      college: '방목기초교육대학',
      department: [
        '전공자유학부(인문)',
        '전공자유학부(자연)',
        '융합전공학부(인문)',
      ],
    },
    {
      college: '국제학부',
      department: ['글로벌비즈니스전공'],
    },
  ],
};

const NSU_COLLEGE_STATE = {
  id: 'nsu',
  name: '남서울대학교',
  webMail: 'https://portal.nsu.ac.kr',
  state: [
    {
      college: 'SW·AI 융합대학',
      department: [
        '가상현실학과',
        '지능정보통신공학과',
        '컴퓨터소프트웨어학과',
        '멀티미디어학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '전자공학과',
        '건축학과',
        '건축공학과',
        '빅데이터경영공학과',
        '드론공간정보공학과',
        '스마트팜학과',
      ],
    },
    {
      college: '창조문화예술대학',
      department: [
        '시각미디어디자인학과',
        '공간조형디자인학과',
        '영상예술디자인학과',
        '실용음악학과',
      ],
    },
    {
      college: '글로벌상경대학',
      department: [
        '유통마케팅학과',
        '글로벌무역학과',
        '경영학과',
        '호텔경영학과',
        '관광경영학과',
        '광고홍보학과',
        '세무학과',
        '부동산학과',
        '스포츠비즈니스학과',
        '영어과',
        '일어일문학과',
        '중국학과',
        '글로벌한국학과',
        '글로벌한국어문화학과',
      ],
    },
    {
      college: '보건의료복지대학',
      department: [
        '보건행정학과',
        '뷰티보건학과',
        '스포츠건강관리학과',
        '치위생학과',
        '물리치료학과',
        '간호학과',
        '임상병리학과',
        '응급구조학과',
        '아동복지학과',
        '사회복지학과',
        '휴먼케어학과',
        '바이오헬스컨디셔닝학과',
      ],
    },
    {
      college: '연계전공 및 융합전공',
      department: [
        '인공지능융합전공',
        '가상증강현실연계전공',
        '노인건강산업연계전공',
        '스마트케어연계전공',
        '중국통상연계전공',
        '케이뷰티크리에이티브연계전공',
        '케이팝크리에이티브연계전공',
        '디지털융합창업전공',
        '메타콘텐츠융합전공',
        '스마트모빌리티융합전공',
        '스마트팩토리융합전공',
        '치매케어재활융합전공',
        '테라피&테크놀로지융합전공',
      ],
    },
  ],
};

const KGU_COLLEGE_STATE = {
  id: 'kgu',
  name: '경기대학교',
  webMail: 'https://kutis.kyonggi.ac.kr/webkutis/view/indexWeb.jsp',
  state: [
    {
      college: '인문대학',
      department: [
        '국어국문학과',
        '영어영문학과',
        '사학과',
        '문헌정보학과',
        '문예창작학과',
        '유아교육과',
        '독어독문전공',
        '프랑스어전공',
        '일본어전공',
        '중어중문전공',
        '러시아어전공',
      ],
    },
    {
      college: '예술체육대학',
      department: [
        '입체조형학과',
        '체육학과',
        '시큐리티매니지먼트학과',
        '시각정보디자인전공',
        '산업디자인전공',
        '장신구금속디자인전공',
        '한국화전공',
        '서양화전공',
        '미술경영전공',
        '서예전공',
        '스포츠건강과학전공',
        '스포츠레저산업전공',
      ],
    },
    {
      college: '사회과학대학',
      department: [
        '법학과',
        '무역학과',
        '범죄교정심리전공',
        '경찰행정전공',
        '사회복지전공',
        '청소년전공',
        '행정정책전공',
        '정치외교학전공',
        '경제학전공',
        '응용통계학전공',
        '지식재산학전공',
      ],
    },
    {
      college: '소프트웨어경영대학',
      department: [
        '경영학전공',
        '회계세무학전공',
        '산업경영정보공학과',
        '컴퓨터융합전공',
        '인공지능전공',
        'SW안전보안전공',
      ],
    },
    {
      college: '융합과학대학',
      department: ['수학과', '화학과', '생명과학전공', '식품생물공학전공'],
    },
    {
      college: '창의공과대학',
      department: [
        '건축학과',
        '사회에너지시스템공학과',
        '기계시스템공학과',
        '나노반도체전공',
        '정보통신시스템전공',
        '신소재공학전공',
        '화학공학전공',
        '건축공학전공',
        '도시교통공학전공',
        '건축안전공학과',
        '공학교육혁신센터',
      ],
    },
    {
      college: '관광문화대학',
      department: [
        '연기학과',
        '애니메이션학과',
        '미디어영상학과',
        '실용음악학과',
        '관광개발경영학과',
        '관광문화콘텐츠학과',
        '호텔경영전공',
        '외식조리전공',
        '외식조리관광서비스학과',
      ],
    },
  ],
};

const PCU_COLLEGE_STATE = {
  id: 'pcu',
  name: '배재대학교',
  webMail: 'https://portal.pcu.ac.kr/',
  state: [
    {
      college: '인문사회대학',
      department: [
        '국어국문한국어교육학과',
        '일본학과',
        '철학전공',
        '행정학과',
        '심리학전공',
        '유아교육과',
      ],
    },
    {
      college: '경영대학',
      department: [
        '경영학과',
        'IT경영정보학과',
        '글로벌비즈니스학과',
        '관광경영학과',
        '호텔경영학과',
        '항공서비스학과',
      ],
    },
    {
      college: '생명보건대학',
      department: [
        '생명과학과',
        '식품영양학과',
        '의생명과학과',
        '원예학전공',
        '보건의료복지학과',
        '간호학과',
      ],
    },
    {
      college: 'AI·SW창의융합대학',
      department: [
        '전기전자공학과',
        '스마트데이터학부',
        '드론포럼공학과',
        '정보보안학과',
        '소프트웨어융합학부',
      ],
    },
    {
      college: '문화예술대학',
      department: [
        '건축학과',
        '실내건축학과',
        '조경학과',
        '아트컨텐츠학부',
        '디자인학부',
        '공간사진영상학과',
        '미디어컨텐츠학과',
        '의류패션학과',
        '뷰티바이오학과',
        '공연예술학과',
        '레저스포츠학과',
      ],
    },
    {
      college: '주시경교양대학',
      department: ['글로벌자율융합학부', '평생교육융합학부', '자율전공학부'],
    },
  ],
};

const DSU_COLLEGE_STATE = {
  id: 'dsu',
  name: '동신대학교',
  webMail: 'https://gmail.com',
  state: [
    {
      college: '에너지공과대학',
      department: [
        '건축학과',
        '산림조경학과',
        '토목환경공학과',
        '컴퓨터학과',
        '디지털콘텐츠학과',
        '전기공학과',
      ],
    },
    {
      college: '한의과대학',
      department: ['한의예과', '간호학과', '응급구조학과'],
    },
    {
      college: '보건복지대학',
      department: [
        '물리치료학과',
        '방사선학과',
        '작업치료학과',
        '안경광학과',
        '보건행정학과',
        '언어치료학과',
        '식품영양학과',
        '스포츠의학과',
        '반려동물학과',
        '뷰티미용학과',
        '사회복지학과',
        '상담심리학과',
      ],
    },
    {
      college: '사회문화대학',
      department: [
        '국제한국어학과',
        '경찰행정학과',
        '소방안전학과',
        '군사학과',
        '유아교육학과',
        '도시계획학과',
        '호텔관광경영학과',
        '생활체육학과',
        '태권도학과',
        '뮤지컬·실용음악과',
        '공연예술무용학과',
      ],
    },
    {
      college: '글로벌자율전공대학',
      department: ['자율전공학부', '다문화융합학부'],
    },
    {
      college: '미래라이프대학',
      department: [
        '에너지사이클링학과',
        '헬스케어복지학과',
        'K-남도문화학과',
        '한국어교육학과',
      ],
    },
  ],
};

const DANKOOK_COLLEGE_STATE = {
  id: 'dankook',
  name: '단국대학교',
  webMail: 'http://outlook.com/dankook.ac.kr',
  state: [
    {
      college: '문과대학',
      department: ['국어국문학과', '영어영문학과', '사학과', '철학과'],
    },
    {
      college: '법과대학',
      department: ['법학과'],
    },
    {
      college: '사회과학대학',
      department: [
        '정치외교학과',
        '행정학과',
        '미디어커뮤니케이션학부',
        '상담학과',
        '도시계획부동산학부',
      ],
    },
    {
      college: '경영경제대학',
      department: [
        '경제학과',
        '무역학과',
        '경영학부',
        '산업경영공학과',
        '글로벌경영학과',
      ],
    },
    {
      college: '공과대학',
      department: [
        '전자전기공학과',
        '융합반도체공학과',
        '교통시스템공학과',
        '토목환경공학과',
        '기계공학과',
        '화학공학과',
        '건축학과',
        '공학교육혁신센터',
      ],
    },
    {
      college: 'SW융합대학',
      department: [
        '소프트웨어학과',
        '컴퓨터공학과',
        '모바일시스템공학과',
        '통계데이터사이언스학과',
        '사이버보안학과',
        'SW융합학부',
      ],
    },
    {
      college: '사범대학',
      department: [
        '한문교육과',
        '특수교육과',
        '수학교육과',
        '과학교육과',
        '체육교육과',
        '교직교육과',
      ],
    },
    {
      college: '음악·예술대학',
      department: ['무용과', '음악학과', '공연예술학과'],
    },
  ],
};

export const UNIV_STATE = [
  DGU_COLLEGE_STATE,
  SCH_COLLEGE_STATE,
  KHU_COLLEGE_STATE,
  SWU_COLLEGE_STATE,
  JNU_COLLEGE_STATE,
  KAYA_COLLEGE_STATE,
  GACHON_COLLEGE_STATE,
  CKU_COLLEGE_STATE,
  CATHOLIC_COLLEGE_STATE,
  KANGNAM_COLLEGE_STATE,
  DONGA_COLLEGE_STATE,
  KYUNGNAM_COLLEGE_STATE,
  CAU_COLLEGE_STATE,
  HANYANG_ERICA_COLLEGE_STATE,
  CHANGWON_COLLEGE_STATE,
  HANSUNG_COLLEGE_STATE,
  CSU_COLLEGE_STATE,
  KMA_COLLEGE_STATE,
  SOGANG_COLLEGE_STATE,
  SYU_COLLEGE_STATE,
  JNUE_COLLEGE_STATE,
  BU_COLLEGE_STATE,
  MJC_COLLEGE_STATE,
  KW_COLLEGE_STATE,
  GJUE_COLLEGE_STATE,
  KONKUK_COLLEGE_STATE,
  SUNMOON_COLLEGE_STATE,
  HOSEO_COLLEGE_STATE,
  TUKOREA_COLLEGE_STATE,
  PTU_COLLEGE_STATE,
  JBNU_COLLEGE_STATE,
  KOOKMIN_COLLEGE_STATE,
  SEOULTECH_COLLEGE_STATE,
  SMU_SEOUL_COLLEGE_STATE,
  SMU_CHEONAN_COLLEGE_STATE,
  MJU_COLLEGE_STATE,
  NSU_COLLEGE_STATE,
  KGU_COLLEGE_STATE,
  PCU_COLLEGE_STATE,
  DSU_COLLEGE_STATE,
  DANKOOK_COLLEGE_STATE,
];
